tap "cognominal/neovim-nightly.fork"
tap "felixkratz/formulae"
tap "jandedobbeleer/oh-my-posh"
tap "julien-cpsn/atac"
tap "mobile-dev-inc/tap"
tap "nikitabobko/tap"
tap "sst/tap"
tap "supabase/tap"
tap "txn2/tap"
# Build full-stack web and mobile apps in hours. Easy to start, easy to scale
brew "aws-amplify"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Lightweight, framework-agnostic database migration tool
brew "dbmate"
# Debugger for the Go programming language
brew "delve"
# Pack, ship and run any application as a lightweight container
brew "docker"
# AST-based pattern checker for JavaScript
brew "eslint"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Go formatter that additionally inserts import statements
brew "goimports"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Human friendly `go test` runner
brew "gotestsum"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Utility to list open files
brew "lsof"
# Language Server for the Lua language
brew "lua-language-server"
# Manage multiple Node.js versions
brew "nvm"
# Smart, Fast and Extensible Build System
brew "nx"
# AI coding agent, built for the terminal
brew "opencode"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Object-relational database system
brew "postgresql@17", restart_service: :changed
# Prettier daemon
brew "prettierd"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate type safe Go from SQL
brew "sqlc"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Command-line tool for Stripe
brew "stripe-cli"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Language for application scale JavaScript development
brew "typescript"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A simple API client (postman like) in your terminal
brew "julien-cpsn/atac/atac"
# The easiest way to automate UI testing for your mobile app
brew "mobile-dev-inc/tap/maestro"
# Supabase CLI
brew "supabase/tap/supabase"
# Kubernetes bulk port forwarding utility.
brew "txn2/tap/kubefwd"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Web browser focusing on privacy
cask "brave-browser"
# Terminal-based AI coding assistant
cask "claude-code"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open-source media center
cask "stremio"
# Multimedia player
cask "vlc"
go "github.com/air-verse/air"
go "github.com/spf13/cobra-cli"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/99designs/gqlgen"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
