tap "benjiwolff/neovim-nightly"
tap "felixkratz/formulae"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
tap "sst/tap"
brew "awscli"
brew "cocoapods"
brew "fastlane"
brew "fd"
brew "fzf"
brew "gh"
brew "gitleaks"
brew "go"
brew "lazygit"
brew "node"
brew "nvm"
brew "pass"
brew "postgresql@14"
brew "postgresql@17", restart_service: :changed
brew "ripgrep"
brew "sqlc"
brew "stow"
brew "stripe-cli"
brew "tmux"
brew "yarn"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "sst/tap/opencode"
cask "aerospace"
cask "brave-browser"
cask "dbeaver-community"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "obs"
cask "postman"
cask "raycast"
cask "vlc"
cask "wezterm"
cask "zen"
go "github.com/air-verse/air"
go "github.com/cweill/gotests/gotests"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/swaggo/swag/cmd/swag"
